In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb
from sklearn.preprocessing import LabelEncoder
import warnings
warnings.filterwarnings("ignore")

In [2]:
sales_train = pd.read_csv("C:\\Users\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\sales_train.csv")
test = pd.read_csv("C:\\Users\\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\test.csv")
item_categories = pd.read_csv("C:\\Users\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\item_categories.csv")
items = pd.read_csv("C:\\Users\\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\items.csv")
shops = pd.read_csv("C:\\Users\\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\shops.csv")

In [3]:
sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [4]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [5]:
item_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [6]:
items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [7]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [8]:
print(items.shape)
print(item_categories.shape)
print(test.shape)
print(shops.shape)
print(sales_train.shape)

(22170, 3)
(84, 2)
(214200, 3)
(60, 2)
(2935849, 6)

In [9]:
print(items['item_category_id'].min())
print(items['item_category_id'].max())

0
83

In [10]:
print(item_categories['item_category_id'].min())
print(item_categories['item_category_id'].max())

0
83

In [11]:
df = pd.merge(items,item_categories,how = 'left',on = 'item_category_id')

In [12]:
df.head()

,item_name,item_id,item_category_id,item_category_name
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40,Кино - DVD
1,!ABBYY FineReader 12 Professional Edition Full...,1,76,Программы - Для дома и офиса (Цифра)
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40,Кино - DVD
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40,Кино - DVD
4,***КОРОБКА (СТЕКЛО) D,4,40,Кино - DVD

In [13]:
print(sales_train['item_id'].min())
print(sales_train['item_id'].max())

0
22169

In [14]:
print(df['item_id'].min())
print(df['item_id'].max())

0
22169

In [15]:
df2 = pd.merge(sales_train,df,how = 'left',on = 'item_id')

In [16]:
df2.shape

(2935849, 9)

In [17]:
print(shops['shop_id'].min())
print(shops['shop_id'].max())

0
59

In [18]:
print(df2['shop_id'].min())
print(df2['shop_id'].max())

0
59

In [19]:
df3 = pd.merge(df2,shops,how = 'left',on = 'shop_id')

In [20]:
df3.shape

(2935849, 10)

In [21]:
df3.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_name,item_category_id,item_category_name,shop_name
0,02.01.2013,0,59,22154,999.00,1.0,ЯВЛЕНИЕ 2012 (BD),37,Кино - Blu-Ray,"Ярославль ТЦ ""Альтаир"""
1,03.01.2013,0,25,2552,899.00,1.0,DEEP PURPLE The House Of Blue Light LP,58,Музыка - Винил,"Москва ТРК ""Атриум"""
2,05.01.2013,0,25,2552,899.00,-1.0,DEEP PURPLE The House Of Blue Light LP,58,Музыка - Винил,"Москва ТРК ""Атриум"""
3,06.01.2013,0,25,2554,1709.05,1.0,DEEP PURPLE Who Do You Think We Are LP,58,Музыка - Винил,"Москва ТРК ""Атриум"""
4,15.01.2013,0,25,2555,1099.00,1.0,DEEP PURPLE 30 Very Best Of 2CD (Фирм.),56,Музыка - CD фирменного производства,"Москва ТРК ""Атриум"""

In [22]:
df3 = df3.drop(['item_name','item_category_name','shop_name','item_category_id','date_block_num','item_price','item_price'],axis =1)

In [23]:
df3

               date  shop_id  item_id  item_cnt_day
0        02.01.2013       59    22154           1.0
1        03.01.2013       25     2552           1.0
2        05.01.2013       25     2552          -1.0
3        06.01.2013       25     2554           1.0
4        15.01.2013       25     2555           1.0
...             ...      ...      ...           ...
2935844  10.10.2015       25     7409           1.0
2935845  09.10.2015       25     7460           1.0
2935846  14.10.2015       25     7459           1.0
2935847  22.10.2015       25     7440           1.0
2935848  03.10.2015       25     7460           1.0

[2935849 rows x 4 columns]

In [24]:
df3.isnull().sum()

date            0
shop_id         0
item_id         0
item_cnt_day    0
dtype: int64

In [25]:
test.isnull().sum()

ID         0
shop_id    0
item_id    0
dtype: int64

In [26]:
df3['date'] = pd.to_datetime(df2['date'], dayfirst=True)
df3['date'] = df3['date'].apply(lambda x: x.strftime('%Y-%m'))
df3.head()

      date  shop_id  item_id  item_cnt_day
0  2013-01       59    22154           1.0
1  2013-01       25     2552           1.0
2  2013-01       25     2552          -1.0
3  2013-01       25     2554           1.0
4  2013-01       25     2555           1.0

In [27]:
train = df3.groupby(['date','shop_id','item_id']).sum()
train = train.pivot_table(index=['shop_id','item_id'], columns='date', values='item_cnt_day', fill_value=0)
train.reset_index(inplace=True)

In [28]:
train.head()

date,shop_id,item_id,2013-01,2013-02,2013-03,2013-04,2013-05,2013-06,2013-07,2013-08,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,0,30,0,31,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,31,0,11,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,32,6,10,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,33,3,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,35,1,14,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [29]:
test = pd.merge(test,train, on=['shop_id','item_id'], how='left')
test.drop(['ID','2013-01'], axis=1, inplace=True)
test = test.fillna(0)
test.head()

,shop_id,item_id,2013-02,2013-03,2013-04,2013-05,2013-06,2013-07,2013-08,2013-09,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,5,5037,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,2.0,0.0,0.0,0.0,1.0,1.0,1.0,3.0,1.0,0.0
1,5,5320,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,5,5233,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,3.0,2.0,0.0,1.0,3.0,1.0
3,5,5232,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,5,5268,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [30]:
Y = train['2015-10'].values
X = train.drop(['2015-10'], axis = 1)

print(X.shape, Y.shape)

(424124, 35) (424124,)

In [31]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split( X, Y, test_size=0.2, random_state=101)
print ('Train set:', x_train.shape, y_train.shape)
print ('Test set:', x_test.shape, y_test.shape)

Train set: (339299, 35) (339299,)
Test set: (84825, 35) (84825,)

In [32]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error
LR = LinearRegression()
LR.fit(x_train,y_train)

print('Train set mse:', mean_squared_error(y_train, LR.predict(x_train)))
print('Test set mse:', mean_squared_error(y_test, LR.predict(x_test)))
print('Test set score:', LR.score(x_train,y_train))

Train set mse: 10.77508659687804
Test set mse: 7.34926412941016
Test set score: 0.42878283190980937

In [33]:
from sklearn.ensemble import RandomForestRegressor
RFR = RandomForestRegressor(n_estimators = 10)
RFR.fit(x_train,y_train)

print('Train set mse:', mean_squared_error(y_train, RFR.predict(x_train)))
print('Test set mse:', mean_squared_error(y_test, RFR.predict(x_test)))
print('Test set score:', RFR.score(x_train,y_train))

Train set mse: 1.657957966277531
Test set mse: 1.2917529030356616
Test set score: 0.9121070586491601

In [34]:
prediction = RFR.predict(test)
prediction

array([0.3, 0.5, 1.1, ..., 0. , 0.9, 0. ])

In [35]:
df_submission = pd.read_csv('C:\\Users\\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\sample_submission.csv')
print(df_submission.shape)
df_submission.head()

(214200, 2)

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [36]:
df_submission['item_cnt_month'] = prediction
df_submission.to_csv('C:\\Users\\Harshita\\Desktop\\Data Science\\competitive-data-science-predict-future-sales\\prediction.csv', index=False)
df_submission.head()

   ID  item_cnt_month
0   0             0.3
1   1             0.5
2   2             1.1
3   3             0.0
4   4             0.5